Razer3001/Atari_XF551_Wifi/RP/ESP32_Master_Bridge.ino/ESP32_Master_Bridge.ino.ino
/*
  ESP32 MASTER BRIDGE + WEB UI
  ----------------------------
  - Recibe frames binarios por Serial2 desde el RP2040:
      UART_SYNC(0x55) + LEN + PAYLOAD + CHK
  - PAYLOAD[0] = tipo (0x01, 0x10, 0x11, 0x12, 0x20)
  - Reenvía por ESP-NOW hacia el SLAVE:
      * TYPE_CMD_FRAME (0x01) -> SLAVE (XF551)
        Formato esperado (desde RP):
          [0]=TYPE_CMD_FRAME
          [1]=cmd
          [2]=dev (0x31..0x34)
          [3]=secL / aux1
          [4]=secH / aux2
          [5]=densFlag
          [6]=prefetchCount (aquí se aplica prefetchCfg[dev])
  - Recibe desde SLAVE por ESP-NOW:
      * TYPE_HELLO (0x20)
      * TYPE_SECTOR_CHUNK (0x10)
      * TYPE_ACK (0x11)
      * TYPE_NAK (0x12)
    y los reenvía por UART al RP2040 con el mismo framing.

  - Web UI (HTTP en puerto 80, AP "XF551_MASTER" / "xf551wifi"):
      • Ver estado de disqueteras (SLAVES)
      • Ajustar tiempos SIO (solo config, guardados en NVS)
      • Ajustar prefetch por unidad (0..MAX_PREFETCH_SECTORS), usado para
        sobrescribir el campo prefetch en TYPE_CMD_FRAME hacia los SLAVES.
*/

#include <Arduino.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <WebServer.h>
#include <Preferences.h>
#include <stdarg.h>

// ===== Protocol =====
#define TYPE_CMD_FRAME    0x01
#define TYPE_SECTOR_CHUNK 0x10
#define TYPE_ACK          0x11
#define TYPE_NAK          0x12
#define TYPE_HELLO        0x20

#define UART_SYNC 0x55

// D1..D4
#define DEV_MIN 0x31
#define DEV_MAX 0x34

// Prefetch máximo que vamos a permitir configurar
#define MAX_PREFETCH_SECTORS 4

// Broadcast MAC
const uint8_t BCAST_MAC[6] = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};

// Último SLAVE conocido (para compat)
uint8_t g_lastSlave[6] = {0};
bool    g_haveSlave    = false;

// UART2 (con RP2040)
const int PIN_RP_RX = 16; // RX2
const int PIN_RP_TX = 17; // TX2

// ========= Estado de SLAVES (uno por unidad) =========
struct SlaveInfo {
  bool present;
  bool supports256;
  uint8_t mac[6];
  unsigned long lastSeen;
};

SlaveInfo slaves[4]; // D1..D4

// Prefetch configurado por unidad (0..MAX_PREFETCH_SECTORS)
uint8_t prefetchCfg[4] = {1, 1, 1, 1};

// ========= Timings SIO (µs) – solo config (para futuro uso con RP) =========
// Valores por defecto
uint16_t T_ACK_TO_COMPLETE   = 600;   // antes 2000
uint16_t T_COMPLETE_TO_DATA  = 400;   // antes 1600
uint16_t T_DATA_TO_CHK       = 80;    // antes 400
uint16_t T_CHUNK_DELAY       = 600;   // antes 1600

// ========= WebServer & NVS =========
WebServer server(80);
Preferences prefs;
const uint32_t CFG_MAGIC = 0xCAFEBABE; // para detectar config válida

// ========= HTML responsive (UI móvil) =========

const char INDEX_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html lang="es">
<head>
 <meta charset="UTF-8" />
 <meta name="viewport" content="width=device-width, initial-scale=1" />
 <title>XF551 WiFi - Panel</title>
 <style>
 :root {
 --bg: #020617;
 --accent: #38bdf8;
 --accent-soft: rgba(56, 189, 248, 0.15);
 --accent-strong: rgba(56, 189, 248, 0.45);
 --text: #e5e7eb;
 --text-soft: #9ca3af;
 --border: #1f2937;
 --danger: #f97373;
 --ok: #4ade80;
 }
 * { box-sizing: border-box; }
 body {
 margin: 0;
 font-family: system-ui, -apple-system, BlinkMacSystemFont, "Segoe UI", sans-serif;
 background: radial-gradient(circle at top left, #0f172a 0, #020617 40%, #000 100%);
 color: var(--text);
 }
 .page { min-height: 100vh; padding: 12px; display: flex; flex-direction: column; align-items: center; }
 .app { width: 100%; max-width: 960px; }
 header { margin-bottom: 10px; text-align: center; }
 header h1 { font-size: 1.4rem; margin: 4px 0; }
 header p { font-size: 0.85rem; color: var(--text-soft); margin: 0; }
 .grid { display: grid; grid-template-columns: 1fr; gap: 10px; }
 @media (min-width: 700px) {
 .grid { grid-template-columns: minmax(0, 1.2fr) minmax(0, 1fr); }
 }
 .card {
 background: linear-gradient(135deg, rgba(15,23,42,0.96), rgba(15,23,42,0.9));
 border-radius: 14px;
 border: 1px solid var(--border);
 box-shadow: 0 16px 40px rgba(15,23,42,0.8);
 padding: 12px;
 }
 .card h2 { font-size: 1.1rem; margin: 0 0 8px; display: flex; align-items: center; gap: 6px; }
 .card h2 span.icon {
 display: inline-flex; width: 20px; height: 20px; border-radius: 999px;
 align-items: center; justify-content: center;
 background: var(--accent-soft); color: var(--accent); font-size: 0.9rem;
 }
 .card small { display: block; font-size: 0.75rem; color: var(--text-soft); margin-bottom: 6px; }
 .drives-list { display: flex; flex-direction: column; gap: 6px; }
 .drive-item {
 border-radius: 10px; border: 1px solid var(--border);
 padding: 8px; background: radial-gradient(circle at top left, rgba(15,23,42,0.9), #020617);
 display: flex; flex-direction: column; gap: 4px;
 }
 .drive-header { display: flex; justify-content: space-between; align-items: center; gap: 6px; }
 .drive-name { font-weight: 600; font-size: 0.95rem; }
 .pill {
 padding: 2px 8px; border-radius: 999px; font-size: 0.7rem;
 border: 1px solid var(--border); background: rgba(15,23,42,0.9);
 color: var(--text-soft); white-space: nowrap;
 }
 .pill.ok {
 color: var(--ok); border-color: rgba(74,222,128,0.5); background: rgba(34,197,94,0.12);
 }
 .pill.bad {
 color: var(--danger); border-color: rgba(248,113,113,0.6); background: rgba(248,113,113,0.12);
 }
 .drive-body { display: flex; flex-wrap: wrap; gap: 4px 10px; font-size: 0.75rem; color: var(--text-soft); }
 .drive-body span.label { color: var(--text-soft); }
 .drive-body span.value { color: var(--text); font-weight: 500; }
 .drive-prefetch {
 margin-top: 4px; display: flex; align-items: center; justify-content: space-between;
 gap: 6px; font-size: 0.75rem;
 }
 .switch { position: relative; display: inline-flex; align-items: center; cursor: pointer; gap: 4px; font-size: 0.75rem; }
 .switch input { opacity: 0; width: 0; height: 0; position: absolute; }
 .switch-slider {
 width: 32px; height: 18px; background-color: #111827;
 border-radius: 999px; border: 1px solid var(--border);
 position: relative; transition: background-color 0.15s ease, border-color 0.15s ease;
 }
 .switch-slider::before {
 content: ""; position: absolute; width: 14px; height: 14px; border-radius: 999px;
 background-color: #f9fafb; left: 1px; top: 1px; transition: transform 0.15s ease;
 box-shadow: 0 1px 2px rgba(0,0,0,0.5);
 }
 .switch input:checked + .switch-slider {
 background-color: var(--accent-strong); border-color: rgba(56,189,248,0.8);
 }
 .switch input:checked + .switch-slider::before { transform: translateX(14px); }
 .small-input {
 width: 66px; padding: 4px 6px; border-radius: 6px;
 border: 1px solid var(--border); background: #020617;
 color: var(--text); font-size: 0.75rem;
 }
 .small-input:focus {
 outline: none; border-color: var(--accent); box-shadow: 0 0 0 1px rgba(56,189,248,0.5);
 }
 .timing-grid {
 display: grid; grid-template-columns: repeat(2, minmax(0, 1fr));
 gap: 6px; margin-top: 8px;
 }
 @media (min-width: 700px) {
 .timing-grid { grid-template-columns: repeat(4, minmax(0, 1fr)); }
 }
 .timing-item {
 background: rgba(15,23,42,0.85); border-radius: 8px;
 border: 1px solid var(--border); padding: 6px; font-size: 0.75rem;
 }
 .timing-item label { display: block; margin-bottom: 2px; color: var(--text-soft); }
 .timing-item input {
 width: 100%; padding: 4px 6px; border-radius: 6px;
 border: 1px solid var(--border); background: #020617;
 color: var(--text); font-size: 0.8rem;
 }
 .timing-item input:focus {
 outline: none; border-color: var(--accent); box-shadow: 0 0 0 1px rgba(56,189,248,0.5);
 }
 .actions { margin-top: 10px; display: flex; flex-wrap: wrap; gap: 6px; }
 button {
 border: none; border-radius: 999px; padding: 8px 14px;
 font-size: 0.8rem; font-weight: 500; cursor: pointer;
 display: inline-flex; align-items: center; gap: 6px;
 background: radial-gradient(circle at top left, #0ea5e9, #0369a1);
 color: #f9fafb; box-shadow: 0 10px 25px rgba(8,47,73,0.9);
 transition: transform 0.12s ease, box-shadow 0.12s ease, filter 0.12s ease;
 }
 button:hover {
 transform: translateY(-1px); filter: brightness(1.05);
 box-shadow: 0 12px 28px rgba(8,47,73,0.9);
 }
 button:active { transform: translateY(0); box-shadow: 0 6px 18px rgba(8,47,73,0.9); }
 button.secondary {
 background: radial-gradient(circle at top left, #111827, #020617);
 color: var(--text-soft); box-shadow: none; border: 1px solid var(--border);
 }
 .status-line {
 margin-top: 8px; font-size: 0.75rem; color: var(--text-soft);
 display: flex; flex-wrap: wrap; gap: 6px; align-items: center;
 }
 .status-dot {
 width: 8px; height: 8px; border-radius: 999px;
 background: #4ade80; box-shadow: 0 0 0 5px rgba(74,222,128,0.15);
 }
 .status-dot.err {
 background: #f97373; box-shadow: 0 0 0 5px rgba(248,113,113,0.18);
 }
 .status-msg { flex: 1; min-width: 0; }
 .footer { margin-top: 10px; text-align: center; font-size: 0.7rem; color: var(--text-soft); opacity: 0.7; }
 </style>
</head>
<body>
 <div class="page">
 <div class="app">
 <header>
 <h1>XF551 WiFi · Panel Maestro</h1>
 <p>Estado de disqueteras · Tiempos SIO · Prefetch remoto (bridge)</p>
 </header>

 <div class="grid">
 <!-- Columna izquierda: Disqueteras -->
 <section class="card">
 <h2><span class="icon">💾</span> Disqueteras</h2>
 <small>Toca una unidad para ver su MAC, densidad y prefetch.</small>
 <div id="drives" class="drives-list"></div>
 </section>

