Razer3001/Atari_XF551_Wifi/RP/ESP32_Master_Bridge.ino/ESP32_Master_Bridge.ino.ino
 <!-- Columna derecha: Configuración -->
 <section class="card">
 <h2><span class="icon">⚙️</span> Configuración avanzada</h2>
 <small>Tiempos SIO (guardados en NVS) y prefetch por unidad.</small>

 <div class="timing-grid">
 <div class="timing-item">
 <label for="ackToComplete">ACK → COMPLETE</label>
 <input type="number" id="ackToComplete" min="200" step="50" />
 </div>
 <div class="timing-item">
 <label for="completeToData">COMPLETE → DATA</label>
 <input type="number" id="completeToData" min="200" step="50" />
 </div>
 <div class="timing-item">
 <label for="dataToChk">DATA → CHK</label>
 <input type="number" id="dataToChk" min="50" step="50" />
 </div>
 <div class="timing-item">
 <label for="chunkDelay">Delay entre sectores</label>
 <input type="number" id="chunkDelay" min="200" step="50" />
 </div>
 </div>

 <div class="actions">
 <button id="btnSave">💾 Guardar configuración</button>
 <button id="btnReload" class="secondary">🔄 Recargar estado</button>
 </div>

 <div class="status-line">
 <div id="statusDot" class="status-dot"></div>
 <div id="statusMsg" class="status-msg">Listo.</div>
 </div>
 </section>
 </div>

 <div class="footer">
 ESP32 Master Bridge · XF551 WiFi · V1.1
 </div>
 </div>
 </div>

 <script>
 function $(id) { return document.getElementById(id); }

 function setStatus(msg, ok = true) {
 const dot = $("statusDot");
 const text = $("statusMsg");
 text.textContent = msg;
 if (ok) dot.classList.remove("err");
 else dot.classList.add("err");
 }

 function renderDrives(drives) {
 const container = $("drives");
 container.innerHTML = "";
 if (!drives || drives.length === 0) {
 container.innerHTML = "<small>No hay disqueteras registradas aún.</small>";
 return;
 }
 drives.forEach(d => {
 const div = document.createElement("div");
 div.className = "drive-item";
 const present = !!d.present;
 const supports256 = !!d.supports256;
 const prefetch = !!d.prefetch;
 const prefetchSectors = d.prefetchSectors || 0;
 const mac = d.mac || "—";

 div.innerHTML = `
 <div class="drive-header">
 <div class="drive-name">${d.dev || "DX"}</div>
 <div style="display:flex; gap:4px; align-items:center;">
 <span class="pill ${present ? "ok" : "bad"}">${present ? "ONLINE" : "OFFLINE"}</span>
 <span class="pill">${supports256 ? "DD 256B" : "SD 128B"}</span>
 </div>
 </div>
 <div class="drive-body">
 <div><span class="label">MAC: </span><span class="value">${mac}</span></div>
 <div><span class="label">Prefetch: </span><span class="value">${prefetch ? "Sí" : "No"}</span></div>
 <div><span class="label">Sectores pref.: </span><span class="value">${prefetchSectors}</span></div>
 </div>
 <div class="drive-prefetch">
 <label class="switch">
 <input type="checkbox" data-dev="${d.dev}" class="pf-toggle" ${prefetch ? "checked" : ""}>
 <span class="switch-slider"></span>
 </label>
 <div style="display:flex; align-items:center; gap:4px;">
 <span style="font-size:0.75rem;">Sectores:</span>
 <input
 type="number"
 min="0"
 max="16"
 step="1"
 value="${prefetchSectors}"
 class="small-input pf-count"
 data-dev="${d.dev}"
 />
 </div>
 </div>
 `;
 container.appendChild(div);
 });
 }

 async function loadStatus() {
 try {
 setStatus("Cargando estado...", true);
 const res = await fetch("/api/status");
 if (!res.ok) throw new Error("HTTP " + res.status);
 const data = await res.json();

 renderDrives(data.drives || []);

 if (data.timings) {
 $("ackToComplete").value = data.timings.ackToComplete ?? "";
 $("completeToData").value = data.timings.completeToData ?? "";
 $("dataToChk").value = data.timings.dataToChk ?? "";
 $("chunkDelay").value = data.timings.chunkDelay ?? "";
 }
 setStatus("Estado actualizado.");
 } catch (e) {
 console.error(e);
 setStatus("Error al obtener estado: " + e.message, false);
 }
 }

 function collectConfig() {
 const drives = [];
 document.querySelectorAll(".drive-item").forEach(div => {
 const dev = div.querySelector(".drive-name").textContent.trim();
 const toggle = div.querySelector(".pf-toggle");
 const inputCount = div.querySelector(".pf-count");
 let sectors = inputCount ? Number(inputCount.value) || 0 : 0;
 if (!toggle.checked) sectors = 0;
 drives.push({ dev, prefetch: sectors > 0, prefetchSectors: sectors });
 });

 const timings = {
 ackToComplete: Number($("ackToComplete").value) || 0,
 completeToData: Number($("completeToData").value) || 0,
 dataToChk: Number($("dataToChk").value) || 0,
 chunkDelay: Number($("chunkDelay").value) || 0
 };

 return { drives, timings };
 }

 function mapPrefetchByDev(drives) {
 const out = { D1: 0, D2: 0, D3: 0, D4: 0 };
 drives.forEach(d => {
 const dev = d.dev;
 if (out.hasOwnProperty(dev)) {
 out[dev] = d.prefetchSectors || 0;
 }
 });
 return out;
 }

 async function saveConfig() {
  try {
    const cfg = collectConfig();
    const pf = mapPrefetchByDev(cfg.drives);

    setStatus("Guardando configuración...", true);

    const urlTiming =
      `/set_timing?t_ack=${cfg.timings.ackToComplete}` +
      `&t_comp=${cfg.timings.completeToData}` +
      `&t_chk=${cfg.timings.dataToChk}` +
      `&t_chunk=${cfg.timings.chunkDelay}`;

    const urlPrefetch =
      `/set_prefetch?pf1=${pf.D1}&pf2=${pf.D2}&pf3=${pf.D3}&pf4=${pf.D4}`;

    const r1 = await fetch(urlTiming);
    if (!r1.ok) throw new Error("Error en /set_timing (" + r1.status + ")");

    const r2 = await fetch(urlPrefetch);
    if (!r2.ok) throw new Error("Error en /set_prefetch (" + r2.status + ")");

    setStatus("Configuración guardada. Recargando estado...");
    await loadStatus();
  } catch (e) {
    console.error(e);
    setStatus("Error al guardar configuración: " + e.message, false);
  }
 }

 document.addEventListener("DOMContentLoaded", () => {
 $("btnReload").addEventListener("click", loadStatus);
 $("btnSave").addEventListener("click", saveConfig);
 loadStatus();
 });
 </script>
</body>
</html>
)rawliteral";

// ========= Utils =========

void logf(const char* fmt, ...) {
  char buf[256];
  va_list ap;
  va_start(ap, fmt);
  vsnprintf(buf, sizeof(buf), fmt, ap);
  va_end(ap);
  Serial.println(buf);
}

void logHex(const char* prefix, const uint8_t* data, int len, int maxBytes = 16) {
  Serial.print(prefix);
  int n = (len < maxBytes) ? len : maxBytes;
  for (int i = 0; i < n; i++) {
    Serial.print(' ');
    if (data[i] < 0x10) Serial.print('0');
    Serial.print(data[i], HEX);
  }
  Serial.println();
}

