Razer3001/Atari_XF551_Wifi/RP/ESP32_Master_Bridge.ino/ESP32_Master_Bridge.ino.ino
uint8_t calcChecksum(const uint8_t* buf, int len) {
  uint16_t s = 0;
  for (int i = 0; i < len; i++) s += buf[i];
  return (uint8_t)s;
}

void ensurePeer(const uint8_t* mac) {
  if (!mac) return;
  if (esp_now_is_peer_exist(mac)) return;
  esp_now_peer_info_t p = {};
  memcpy(p.peer_addr, mac, 6);
  p.channel = 0;
  p.encrypt = false;
  esp_err_t e = esp_now_add_peer(&p);
  if (e != ESP_OK) {
    logf("[ESPNOW] esp_now_add_peer error=%d", (int)e);
  }
}

int devIndex(uint8_t dev){
  if (dev < DEV_MIN || dev > DEV_MAX) return -1;
  return dev - DEV_MIN; // 0..3
}

const char* devName(uint8_t dev){
  static const char* names[] = {"D1", "D2", "D3", "D4"};
  int idx = devIndex(dev);
  return (idx >= 0) ? names[idx] : "UNK";
}

uint8_t prefetchForDev(uint8_t dev){
  int idx = devIndex(dev);
  if (idx < 0) return 0;
  return prefetchCfg[idx];
}

String formatMac(const uint8_t mac[6]){
  char buf[32];
  sprintf(buf, "%02X:%02X:%02X:%02X:%02X:%02X",
          mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

const uint8_t* slaveMac() {
  return g_haveSlave ? g_lastSlave : BCAST_MAC;
}

bool sendEspNow(const uint8_t* mac, const uint8_t* data, int len) {
  ensurePeer(mac);
  esp_err_t r = esp_now_send(mac, data, len);
  return (r == ESP_OK);
}

bool sendEspToSlave(const uint8_t* data, int len) {
  return sendEspNow(slaveMac(), data, len);
}

// ========= Pendiente de WRITE desde el RP =========

struct PendingWriteFromRP {
  bool    active;
  uint8_t dev;
  uint16_t sec;
};

PendingWriteFromRP g_pendingWriteRP = { false, 0, 0 };

// ========= NVS: cargar/guardar configuración =========

void saveTimingConfigToNvs(){
  if (!prefs.begin("xf551cfg", false)) {
    logf("[NVS] Error al abrir NVS para tiempos");
    return;
  }
  prefs.putUInt("magic", CFG_MAGIC);
  prefs.putUShort("t_ack",  T_ACK_TO_COMPLETE);
  prefs.putUShort("t_comp", T_COMPLETE_TO_DATA);
  prefs.putUShort("t_chk",  T_DATA_TO_CHK);
  prefs.putUShort("t_chd",  T_CHUNK_DELAY);
  prefs.end();
  logf("[NVS] Tiempos guardados");
}

void savePrefetchConfigToNvs(){
  if (!prefs.begin("xf551cfg", false)) {
    logf("[NVS] Error al abrir NVS para prefetch");
    return;
  }
  prefs.putUInt("magic", CFG_MAGIC);
  prefs.putUChar("pf1", prefetchCfg[0]);
  prefs.putUChar("pf2", prefetchCfg[1]);
  prefs.putUChar("pf3", prefetchCfg[2]);
  prefs.putUChar("pf4", prefetchCfg[3]);
  prefs.end();
  logf("[NVS] Prefetch guardado");
}

void loadConfigFromNvs(){
  if (!prefs.begin("xf551cfg", false)) {
    logf("[NVS] No se pudo abrir NVS, uso defaults");
    return;
  }

  uint32_t magic = prefs.getUInt("magic", 0);
  if (magic != CFG_MAGIC) {
    prefs.putUInt("magic", CFG_MAGIC);
    prefs.putUShort("t_ack",  T_ACK_TO_COMPLETE);
    prefs.putUShort("t_comp", T_COMPLETE_TO_DATA);
    prefs.putUShort("t_chk",  T_DATA_TO_CHK);
    prefs.putUShort("t_chd",  T_CHUNK_DELAY);
    prefs.putUChar("pf1", prefetchCfg[0]);
    prefs.putUChar("pf2", prefetchCfg[1]);
    prefs.putUChar("pf3", prefetchCfg[2]);
    prefs.putUChar("pf4", prefetchCfg[3]);
    prefs.end();
    logf("[NVS] Config inicial grabada (defaults)");
    return;
  }

  T_ACK_TO_COMPLETE   = prefs.getUShort("t_ack",  T_ACK_TO_COMPLETE);
  T_COMPLETE_TO_DATA  = prefs.getUShort("t_comp", T_COMPLETE_TO_DATA);
  T_DATA_TO_CHK       = prefs.getUShort("t_chk",  T_DATA_TO_CHK);
  T_CHUNK_DELAY       = prefs.getUShort("t_chd",  T_CHUNK_DELAY);

  prefetchCfg[0] = prefs.getUChar("pf1", prefetchCfg[0]);
  prefetchCfg[1] = prefs.getUChar("pf2", prefetchCfg[1]);
  prefetchCfg[2] = prefs.getUChar("pf3", prefetchCfg[2]);
  prefetchCfg[3] = prefs.getUChar("pf4", prefetchCfg[3]);

  prefs.end();

  logf("[NVS] Config cargada:");
  logf(" T_ACK_TO_COMPLETE=%u",  T_ACK_TO_COMPLETE);
  logf(" T_COMPLETE_TO_DATA=%u", T_COMPLETE_TO_DATA);
  logf(" T_DATA_TO_CHK=%u",      T_DATA_TO_CHK);
  logf(" T_CHUNK_DELAY=%u",      T_CHUNK_DELAY);
  logf(" Prefetch D1..D4=%u,%u,%u,%u",
       prefetchCfg[0], prefetchCfg[1], prefetchCfg[2], prefetchCfg[3]);
}

// ========= Web UI Handlers =========

void handleRoot(){
  server.send_P(200, "text/html", INDEX_HTML);
}

void handleApiStatus(){
  Serial.println("[WEB] /api/status llamado");

  String json;
  json.reserve(1024);
  json += F("{\"drives\":[");
  unsigned long now = millis();

  bool first = true;
  for (uint8_t dev = DEV_MIN; dev <= DEV_MAX; dev++){
    int idx = devIndex(dev);
    if (idx < 0) continue;

    if (!first) json += ',';
    first = false;

    json += F("{\"dev\":\"");
    json += devName(dev);
    json += F("\",");

    json += F("\"present\":");
    json += (slaves[idx].present ? F("true") : F("false"));
    json += F(",");

    json += F("\"supports256\":");
    json += (slaves[idx].supports256 ? F("true") : F("false"));
    json += F(",");

    json += F("\"mac\":\"");
    if (slaves[idx].present){
      json += formatMac(slaves[idx].mac);
    }
    json += F("\",");

    json += F("\"prefetch\":");
    json += (prefetchCfg[idx] > 0 ? F("true") : F("false"));
    json += F(",");

    json += F("\"prefetchSectors\":");
    json += String(prefetchCfg[idx]);

    json += F(",\"lastSeenMs\":");
    if (slaves[idx].present){
      json += String(now - slaves[idx].lastSeen);
    } else {
      json += F("0");
    }
    json += F("}");
  }

  json += F("],\"timings\":{");
  json += F("\"ackToComplete\":");  json += String(T_ACK_TO_COMPLETE);  json += F(",");
  json += F("\"completeToData\":"); json += String(T_COMPLETE_TO_DATA); json += F(",");
  json += F("\"dataToChk\":");      json += String(T_DATA_TO_CHK);      json += F(",");
  json += F("\"chunkDelay\":");     json += String(T_CHUNK_DELAY);
  json += F("}}");

  Serial.print("[WEB] /api/status JSON = ");
  Serial.println(json);

  server.send(200, "application/json", json);
}

void handleSetTiming(){
  if (server.hasArg("t_ack")){
    T_ACK_TO_COMPLETE = (uint16_t)server.arg("t_ack").toInt();
  }
  if (server.hasArg("t_comp")){
    T_COMPLETE_TO_DATA = (uint16_t)server.arg("t_comp").toInt();
  }
  if (server.hasArg("t_chk")){
    T_DATA_TO_CHK = (uint16_t)server.arg("t_chk").toInt();
  }
  if (server.hasArg("t_chunk")){
    T_CHUNK_DELAY = (uint16_t)server.arg("t_chunk").toInt();
  }

  logf("[WEB] Tiempos: ACK->COMP=%u, COMP->DATA=%u, DATA->CHK=%u, CHUNK=%u",
       T_ACK_TO_COMPLETE, T_COMPLETE_TO_DATA, T_DATA_TO_CHK, T_CHUNK_DELAY);

