Razer3001/Atari_XF551_Wifi/RP/ESP32_Master_Bridge.ino/ESP32_Master_Bridge.ino.ino
  saveTimingConfigToNvs();
  server.send(200, "text/plain", "OK");
}

void handleSetPrefetch(){
  for (int idx = 0; idx < 4; idx++){
    String argName = "pf" + String(idx + 1);
    if (server.hasArg(argName)){
      int v = server.arg(argName).toInt();
      if (v < 0) v = 0;
      if (v > MAX_PREFETCH_SECTORS) v = MAX_PREFETCH_SECTORS;
      prefetchCfg[idx] = (uint8_t)v;
    }
  }

  logf("[WEB] Prefetch: D1=%u, D2=%u, D3=%u, D4=%u",
       prefetchCfg[0], prefetchCfg[1], prefetchCfg[2], prefetchCfg[3]);

  savePrefetchConfigToNvs();
  server.send(200, "text/plain", "OK");
}

// ===== UART TX -> RP2040 =====
void sendUartFrameToRP(const uint8_t* payload, uint8_t len) {
  if (len == 0) return;
  uint8_t chk = calcChecksum(payload, len);

  Serial2.write(UART_SYNC);
  Serial2.write(len);
  Serial2.write(payload, len);
  Serial2.write(chk);
  Serial2.flush();

  Serial.print(F("[MASTER] UART->RP len="));
  Serial.print(len);
  Serial.print(F(" tipo=0x"));
  if (payload[0] < 0x10) Serial.print('0');
  Serial.println(payload[0], HEX);
}

// ===== UART RX <- RP2040 FSM =====
static uint8_t  uartState    = 0;
static uint8_t  uartLen      = 0;
static uint8_t  uartIdx      = 0;
static uint32_t uartLastTime = 0;
static uint8_t  uartBuf[255];

void pollUartFromRP() {
  while (Serial2.available() > 0) {
    uint8_t b = (uint8_t)Serial2.read();
    uartLastTime = millis();

    Serial.print(F("[MASTER UART FSM] state="));
    Serial.print(uartState);
    Serial.print(F(" byte=0x"));
    if (b < 0x10) Serial.print('0');
    Serial.println(b, HEX);

    switch (uartState) {
      case 0:
        if (b == UART_SYNC) uartState = 1;
        break;
      case 1:
        uartLen = b;
        if (uartLen == 0) uartState = 0;
        else {
          uartIdx   = 0;
          uartState = 2;
        }
        break;
      case 2:
        uartBuf[uartIdx++] = b;
        if (uartIdx >= uartLen) uartState = 3;
        break;
      case 3: {
        uint8_t chk = b;
        uint8_t sum = calcChecksum(uartBuf, uartLen);
        if (chk != sum) {
          Serial.println(F("[MASTER] UART: checksum inválido, descartando frame."));
          uartState = 0;
        } else {
          uint8_t type = uartBuf[0];
          Serial.print(F("[MASTER] Frame UART válido recibido, len="));
          Serial.print(uartLen);
          Serial.print(F(" tipo=0x"));
          if (type < 0x10) Serial.print('0');
          Serial.println(type, HEX);

          switch (type) {
            case TYPE_CMD_FRAME: {
              // Opcional: ajustar prefetch antes de reenviar al SLAVE
              if (uartLen >= 7) {
                uint8_t cmd = uartBuf[1];
                uint8_t dev = uartBuf[2];
                uint8_t base = cmd & 0x7F;

                // Prefetch override
                uint8_t pf  = prefetchForDev(dev);
                if (pf > MAX_PREFETCH_SECTORS) pf = MAX_PREFETCH_SECTORS;
                // Si pf>0, sobrescribimos; si es 0, dejamos lo que mande el RP
                if (pf > 0) {
                  uartBuf[6] = pf;
                  logf("[MASTER] Overwrite PREFETCH para %s = %u sectores",
                       devName(dev), pf);
                }

                // Detectar WRITE pendiente (0x50 / 0x57)
                if (base == 0x50 || base == 0x57) {
                  uint16_t sec = (uint16_t)uartBuf[3] | ((uint16_t)uartBuf[4] << 8);
                  g_pendingWriteRP.active = true;
                  g_pendingWriteRP.dev    = dev;
                  g_pendingWriteRP.sec    = sec;
                  logf("[MASTER] WRITE pendiente desde RP dev=%s sec=%u base=0x%02X",
                       devName(dev), (unsigned)sec, (unsigned)base);
                }
              }

              // Comando desde RP -> reenviar al SLAVE
              sendEspToSlave(uartBuf, uartLen);
              Serial.print(F("[MASTER] Enviado payload a SLAVE tipo=0x"));
              if (type < 0x10) Serial.print('0');
              Serial.print(type, HEX);
              Serial.print(F(" len="));
              Serial.println(uartLen);
            } break;

            case TYPE_SECTOR_CHUNK: {
              if (uartLen < 6) {
                Serial.println(F("[MASTER] SECTOR_CHUNK desde RP demasiado corto"));
                break;
              }

              uint8_t dev = uartBuf[1];
              uint16_t sec = (uint16_t)uartBuf[2] | ((uint16_t)uartBuf[3] << 8);
              uint8_t idx = uartBuf[4];
              uint8_t count = uartBuf[5];
              int dlen = uartLen - 6;

              Serial.print(F("[MASTER] SECTOR_CHUNK desde RP dev=0x"));
              if (dev < 0x10) Serial.print('0');
              Serial.print(dev, HEX);
              Serial.print(F(" sec="));
              Serial.print(sec);
              Serial.print(F(" idx="));
              Serial.print(idx);
              Serial.print(F("/"));
              Serial.print(count);
              Serial.print(F(" dataLen="));
              Serial.println(dlen);

              if (!g_pendingWriteRP.active) {
                Serial.println(F("[MASTER] SECTOR_CHUNK desde RP sin WRITE pendiente, se ignora"));
                break;
              }
              if (dev != g_pendingWriteRP.dev || sec != g_pendingWriteRP.sec) {
                Serial.println(F("[MASTER] SECTOR_CHUNK dev/sec no coincide con WRITE pendiente, se ignora"));
                break;
              }

              // Reenviar el chunk tal cual al SLAVE
              sendEspToSlave(uartBuf, uartLen);
              Serial.println(F("[MASTER] SECTOR_CHUNK reenviado al SLAVE (WRITE DATA)"));

              g_pendingWriteRP.active = false;
            } break;

            default:
              // Otros tipos desde RP (no esperados por ahora)
              Serial.println(F("[MASTER] Tipo desconocido desde RP (no reenviado)."));
              break;
          }

          uartState = 0;
        }
        break;
      }
    }
  }

  if (uartState != 0 && (millis() - uartLastTime > 50)) {
    Serial.println(F("[MASTER] UART: timeout mid-frame, reseteando FSM."));
    uartState = 0;
    uartIdx   = 0;
    uartLen   = 0;
  }
}

// ===== ESP-NOW callbacks =====
#if ESP_IDF_VERSION_MAJOR >= 5

