Razer3001/Atari_XF551_Wifi/RP/ESP32_Master_Bridge.ino/ESP32_Master_Bridge.ino.ino
void onDataRecv(const esp_now_recv_info_t *info, const uint8_t* data, int len) {
  if (!data || len <= 0) return;
  const uint8_t* src = info ? info->src_addr : nullptr;

  if (src) {
    bool isBcast = true;
    for (int i = 0; i < 6; i++) {
      if (src[i] != 0xFF) { isBcast = false; break; }
    }
    if (!isBcast) {
      memcpy(g_lastSlave, src, 6);
      g_haveSlave = true;
      ensurePeer(g_lastSlave);
    }
  }

  uint8_t type = data[0];

  Serial.print(F("[MASTER] onDataRecv type=0x"));
  if (type < 0x10) Serial.print('0');
  Serial.print(type, HEX);
  Serial.print(F(" len="));
  Serial.println(len);

  if (type == TYPE_HELLO && len >= 3) {
    uint8_t dev = data[1];
    uint8_t dd  = data[2];

    Serial.print(F("[MASTER] HELLO de SLAVE DEV=0x"));
    if (dev < 0x10) Serial.print('0');
    Serial.println(dev, HEX);

    int idx = devIndex(dev);
    if (idx >= 0 && src) {
      slaves[idx].present     = true;
      slaves[idx].supports256 = (dd != 0);
      memcpy(slaves[idx].mac, src, 6);
      slaves[idx].lastSeen = millis();
      ensurePeer(slaves[idx].mac);
      logf("[HELLO] %s presente DD=%u MAC=%s",
           devName(dev), dd ? 1 : 0, formatMac(slaves[idx].mac).c_str());
    }

    // Reenviar HELLO al RP
    sendUartFrameToRP(data, len);
  }
  else if (type == TYPE_SECTOR_CHUNK || type == TYPE_ACK || type == TYPE_NAK) {
    // Reenviar tal cual al RP
    sendUartFrameToRP(data, len);
  }
}

void onDataSent(const wifi_tx_info_t *info, esp_now_send_status_t s) {
  (void)info;
  if (s == ESP_NOW_SEND_SUCCESS)
    Serial.println(F("[MASTER] ESP-NOW envío OK"));
  else
    Serial.println(F("[MASTER] ESP-NOW fallo en envío"));
}

#else

void onDataRecv(const uint8_t* src, const uint8_t* data, int len) {
  if (!data || len <= 0) return;

  if (src) {
    bool isBcast = true;
    for (int i = 0; i < 6; i++) {
      if (src[i] != 0xFF) { isBcast = false; break; }
    }
    if (!isBcast) {
      memcpy(g_lastSlave, src, 6);
      g_haveSlave = true;
      ensurePeer(g_lastSlave);
    }
  }

  uint8_t type = data[0];

  Serial.print(F("[MASTER] onDataRecv type=0x"));
  if (type < 0x10) Serial.print('0');
  Serial.print(type, HEX);
  Serial.print(F(" len="));
  Serial.println(len);

  if (type == TYPE_HELLO && len >= 3) {
    uint8_t dev = data[1];
    uint8_t dd  = data[2];

    Serial.print(F("[MASTER] HELLO de SLAVE DEV=0x"));
    if (dev < 0x10) Serial.print('0');
    Serial.println(dev, HEX);

    int idx = devIndex(dev);
    if (idx >= 0 && src) {
      slaves[idx].present     = true;
      slaves[idx].supports256 = (dd != 0);
      memcpy(slaves[idx].mac, src, 6);
      slaves[idx].lastSeen = millis();
      ensurePeer(slaves[idx].mac);
      logf("[HELLO] %s presente DD=%u MAC=%s",
           devName(dev), dd ? 1 : 0, formatMac(slaves[idx].mac).c_str());
    }

    sendUartFrameToRP(data, len);
  }
  else if (type == TYPE_SECTOR_CHUNK || type == TYPE_ACK || type == TYPE_NAK) {
    sendUartFrameToRP(data, len);
  }
}

void onDataSent(const uint8_t* mac, esp_now_send_status_t s) {
  (void)mac;
  if (s == ESP_NOW_SEND_SUCCESS)
    Serial.println(F("[MASTER] ESP-NOW envío OK"));
  else
    Serial.println(F("[MASTER] ESP-NOW fallo en envío"));
}

#endif

// ===== SETUP / LOOP =====
void setup() {
  Serial.begin(115200);
  delay(200);

  Serial.println(F("\n=== ESP32 MASTER BRIDGE (RP2040 <-> SLAVE XF551) + WEB ==="));

  Serial2.begin(115200, SERIAL_8N1, PIN_RP_RX, PIN_RP_TX);

  // Inicializar tabla de SLAVES
  for (int i = 0; i < 4; i++){
    slaves[i].present     = false;
    slaves[i].supports256 = false;
    memset(slaves[i].mac, 0, 6);
    slaves[i].lastSeen = 0;
  }

  // Cargar configuración desde NVS
  loadConfigFromNvs();

  // WiFi AP para Web UI
  WiFi.mode(WIFI_AP_STA);
  const char* apSsid = "XF551_MASTER";
  const char* apPass = "xf551wifi";
  WiFi.softAP(apSsid, apPass);

  Serial.print("[WIFI] AP SSID: ");
  Serial.println(apSsid);
  Serial.print("[WIFI] AP IP: ");
  Serial.println(WiFi.softAPIP());

  // ESP-NOW
  if (esp_now_init() != ESP_OK) {
    Serial.println(F("[MASTER] ERROR: esp_now_init fallo"));
    ESP.restart();
  }

  esp_now_register_recv_cb(onDataRecv);
  esp_now_register_send_cb(onDataSent);

  ensurePeer(BCAST_MAC);

  // WebServer
  server.on("/",           handleRoot);
  server.on("/api/status", HTTP_GET, handleApiStatus);
  server.on("/set_timing", HTTP_GET, handleSetTiming);
  server.on("/set_prefetch", HTTP_GET, handleSetPrefetch);
  server.begin();
  Serial.println("[WEB] Servidor HTTP iniciado en puerto 80");
}

void loop() {
  server.handleClient();

  // timeout de presencia de SLAVES (si dejan de enviar HELLO)
  unsigned long now = millis();
  for (int i = 0; i < 4; i++){
    if (slaves[i].present && (now - slaves[i].lastSeen > 60000)){
      slaves[i].present = false;
    }
  }

  // UART bridge
  pollUartFromRP();

  delay(2);
}
